Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4S4A.xml
      <value-group caption="" name="SUPC_WUIR__WKUPEN9">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN10">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN11">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN12">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN13">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN14">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN15">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT0">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT1">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT2">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT3">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT4">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT5">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT6">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT7">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT8">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT9">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT10">
        <value caption="A low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
